In [3]:
import pandas as pd
df = pd.DataFrame([1, 2, 3], columns=['value'])

In [4]:
df

   value
0      1
1      2
2      3

In [5]:
pd.DataFrame([('apple', 160), ('orange', 30), ('kiwi', 20), ('banana', 120)], columns=['name', 'price'])

     name  price
0   apple    160
1  orange     30
2    kiwi     20
3  banana    120

In [6]:
data = {
    'fruit': ['Apple', 'Orange', 'Kiwi', 'Banana'],
    'price': [160, 30, 80, 120],
    'order': [12, 30, 8, 21]
}
df = pd.DataFrame(data)
df

    fruit  order  price
0   Apple     12    160
1  Orange     30     30
2    Kiwi      8     80
3  Banana     21    120

In [7]:
df['total'] = df['price'] * df['order']
df

    fruit  order  price  total
0   Apple     12    160   1920
1  Orange     30     30    900
2    Kiwi      8     80    640
3  Banana     21    120   2520

In [8]:
data = {
    'price': [160, 30, 80, 120],
    'order': [12, 30, 8, 21]
}
df = pd.DataFrame(data, index=['Apple', 'Orange', 'Kiwi', 'Banana'])
df

        order  price
Apple      12    160
Orange     30     30
Kiwi        8     80
Banana     21    120

In [10]:
# ixでSeriesとして取り出せる
df.ix['Apple']

order     12
price    160
Name: Apple, dtype: int64

In [11]:
df.shape

(4, 2)

In [12]:
df['price']

Apple     160
Orange     30
Kiwi       80
Banana    120
Name: price, dtype: int64

In [13]:
df[df.price > 100]

        order  price
Apple      12    160
Banana     21    120

In [14]:
df.where(df.price > 100)

        order  price
Apple    12.0  160.0
Orange    NaN    NaN
Kiwi      NaN    NaN
Banana   21.0  120.0

In [15]:
df.where(df.price > 100).dropna()

        order  price
Apple    12.0  160.0
Banana   21.0  120.0

In [16]:
df.where(df.price > 100).fillna(df.mean())

        order  price
Apple   12.00  160.0
Orange  17.75   97.5
Kiwi    17.75   97.5
Banana  21.00  120.0

In [17]:
df = pd.read_csv('./ruby_1.csv')
df

  name  ruby  php  python  perl
0   一郎   100   40      70    80
1   二郎    60   90      80    10
2   三郎    90   60      60    60
3   四郎    80   70      70    80

In [20]:
sort_by_ruby = df.sort_values(by='ruby', ascending=False)
sort_by_ruby[['name', 'ruby']]

  name  ruby
0   一郎   100
2   三郎    90
3   四郎    80
1   二郎    60

In [21]:
df['mean'] = df.mean(axis=1)
df

  name  ruby  php  python  perl  mean
0   一郎   100   40      70    80  72.5
1   二郎    60   90      80    10  60.0
2   三郎    90   60      60    60  67.5
3   四郎    80   70      70    80  75.0

In [22]:
sort_by_mean_and_ruby = df.sort_values(by=['mean', 'ruby'], ascending=False)[['name', 'mean', 'ruby']]

In [23]:
sort_by_mean_and_ruby

  name  mean  ruby
3   四郎  75.0    80
0   一郎  72.5   100
2   三郎  67.5    90
1   二郎  60.0    60